pangu-7B/throughput/bench_concurrency/result.txt
INFO 12-18 19:38:12 [__init__.py:39] Available plugins for group vllm.platform_plugins:
INFO 12-18 19:38:12 [__init__.py:41] - ascend -> vllm_ascend:register
INFO 12-18 19:38:12 [__init__.py:44] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 12-18 19:38:12 [__init__.py:235] Platform plugin ascend is activated
WARNING 12-18 19:38:13 [_custom_ops.py:20] Failed to import from vllm._C with ImportError('/root/miniconda3/envs/pangu/lib/python3.11/site-packages/vllm/_C.abi3.so: undefined symbol: _ZN3c108ListType3getERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEENS_4Type24SingletonOrSharedTypePtrIS9_EE')
INFO 12-18 19:38:17 [importing.py:63] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_mtp:CustomDeepSeekMTP.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_vl:AscendQwen2VLForConditionalGeneration.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_5_vl:AscendQwen2_5_VLForConditionalGeneration.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture DeepseekV2ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV2ForCausalLM.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV3ForCausalLM.
WARNING 12-18 19:38:17 [registry.py:413] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen3_moe:CustomQwen3MoeForCausalLM.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcde567560>, seed=0, num_prompts=100, dataset_name='random', dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', max_concurrency=None, model='pangu_embedded_7b', tokenizer='/opt/pangu/openPangu-Embedded-7B-V1.1/', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
WARNING 12-18 19:38:20 [tokenizer.py:262] Using a slow tokenizer. This might cause a significant slowdown. Consider using a fast tokenizer instead.
INFO 12-18 19:38:21 [datasets.py:355] Sampling input_len from [1023, 1023] and output_len from [128, 128]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:02<04:32,  2.75s/it]
  2%|▏         | 2/100 [00:05<04:02,  2.48s/it]
  3%|▎         | 3/100 [00:07<03:51,  2.39s/it]
  4%|▍         | 4/100 [00:09<03:44,  2.34s/it]
  5%|▌         | 5/100 [00:11<03:40,  2.32s/it]
  6%|▌         | 6/100 [00:14<03:37,  2.31s/it]
  7%|▋         | 7/100 [00:16<03:34,  2.31s/it]
  8%|▊         | 8/100 [00:18<03:31,  2.30s/it]
  9%|▉         | 9/100 [00:21<03:29,  2.30s/it]
 10%|█         | 10/100 [00:23<03:26,  2.30s/it]
 11%|█         | 11/100 [00:25<03:24,  2.30s/it]
 12%|█▏        | 12/100 [00:27<03:21,  2.30s/it]
 13%|█▎        | 13/100 [00:28<02:37,  1.81s/it]
 14%|█▍        | 14/100 [00:30<02:45,  1.93s/it]
 15%|█▌        | 15/100 [00:33<02:51,  2.01s/it]
 16%|█▌        | 16/100 [00:35<02:54,  2.07s/it]
 17%|█▋        | 17/100 [00:37<02:56,  2.12s/it]
 18%|█▊        | 18/100 [00:39<02:58,  2.17s/it]
 19%|█▉        | 19/100 [00:42<02:59,  2.21s/it]
 20%|██        | 20/100 [00:42<02:07,  1.59s/it]
 21%|██        | 21/100 [00:44<02:22,  1.80s/it]
 22%|██▏       | 22/100 [00:46<02:29,  1.92s/it]
 23%|██▎       | 23/100 [00:48<02:34,  2.00s/it]
 24%|██▍       | 24/100 [00:51<02:36,  2.06s/it]
 25%|██▌       | 25/100 [00:53<02:37,  2.10s/it]
 26%|██▌       | 26/100 [00:55<02:38,  2.14s/it]
 27%|██▋       | 27/100 [00:57<02:37,  2.16s/it]
 29%|██▉       | 29/100 [01:00<02:00,  1.69s/it]
 30%|███       | 30/100 [01:02<02:07,  1.82s/it]
 31%|███       | 31/100 [01:04<02:12,  1.92s/it]
 32%|███▏      | 32/100 [01:06<02:15,  2.00s/it]
 33%|███▎      | 33/100 [01:08<02:17,  2.06s/it]
 34%|███▍      | 34/100 [01:11<02:20,  2.13s/it]
 35%|███▌      | 35/100 [01:13<02:20,  2.16s/it]
 36%|███▌      | 36/100 [01:15<02:18,  2.17s/it]
 37%|███▋      | 37/100 [01:17<02:17,  2.18s/it]
 38%|███▊      | 38/100 [01:17<01:38,  1.59s/it]
 39%|███▉      | 39/100 [01:20<01:48,  1.78s/it]
 40%|████      | 40/100 [01:22<01:54,  1.90s/it]
 41%|████      | 41/100 [01:24<01:58,  2.01s/it]
 42%|████▏     | 42/100 [01:26<01:59,  2.06s/it]
 43%|████▎     | 43/100 [01:29<01:59,  2.10s/it]
 44%|████▍     | 44/100 [01:31<02:00,  2.15s/it]
 45%|████▌     | 45/100 [01:33<01:58,  2.16s/it]
 46%|████▌     | 46/100 [01:35<01:57,  2.18s/it]
 47%|████▋     | 47/100 [01:35<01:23,  1.57s/it]
 48%|████▊     | 48/100 [01:38<01:31,  1.75s/it]
 49%|████▉     | 49/100 [01:40<01:35,  1.88s/it]
 50%|█████     | 50/100 [01:42<01:38,  1.97s/it]
 51%|█████     | 51/100 [01:44<01:39,  2.03s/it]
 52%|█████▏    | 52/100 [01:46<01:40,  2.09s/it]
 53%|█████▎    | 53/100 [01:49<01:40,  2.15s/it]
 54%|█████▍    | 54/100 [01:51<01:40,  2.17s/it]
 55%|█████▌    | 55/100 [01:53<01:39,  2.20s/it]
 56%|█████▌    | 56/100 [01:55<01:37,  2.22s/it]
 57%|█████▋    | 57/100 [01:58<01:36,  2.23s/it]
 58%|█████▊    | 58/100 [02:00<01:34,  2.24s/it]
 59%|█████▉    | 59/100 [02:02<01:32,  2.25s/it]
 60%|██████    | 60/100 [02:02<01:05,  1.65s/it]
 61%|██████    | 61/100 [02:04<01:09,  1.79s/it]
 62%|██████▏   | 62/100 [02:07<01:13,  1.93s/it]
 63%|██████▎   | 63/100 [02:09<01:15,  2.03s/it]
 64%|██████▍   | 64/100 [02:11<01:09,  1.92s/it]
 65%|██████▌   | 65/100 [02:13<01:10,  2.03s/it]
 66%|██████▌   | 66/100 [02:15<01:11,  2.09s/it]
 67%|██████▋   | 67/100 [02:17<01:10,  2.13s/it]
 68%|██████▊   | 68/100 [02:20<01:09,  2.16s/it]
 69%|██████▉   | 69/100 [02:22<01:07,  2.18s/it]
 70%|███████   | 70/100 [02:24<01:05,  2.19s/it]
 71%|███████   | 71/100 [02:26<01:03,  2.20s/it]
 72%|███████▏  | 72/100 [02:29<01:02,  2.22s/it]
 73%|███████▎  | 73/100 [02:29<00:42,  1.59s/it]
 74%|███████▍  | 74/100 [02:31<00:46,  1.80s/it]
 75%|███████▌  | 75/100 [02:33<00:48,  1.94s/it]
 76%|███████▌  | 76/100 [02:36<00:48,  2.04s/it]
 77%|███████▋  | 77/100 [02:38<00:48,  2.09s/it]
 78%|███████▊  | 78/100 [02:40<00:46,  2.13s/it]
 79%|███████▉  | 79/100 [02:42<00:45,  2.16s/it]
 80%|████████  | 80/100 [02:44<00:43,  2.18s/it]
 81%|████████  | 81/100 [02:47<00:41,  2.19s/it]
 82%|████████▏ | 82/100 [02:49<00:39,  2.20s/it]
 83%|████████▎ | 83/100 [02:51<00:37,  2.22s/it]
 84%|████████▍ | 84/100 [02:53<00:35,  2.23s/it]
 85%|████████▌ | 85/100 [02:56<00:33,  2.25s/it]
 86%|████████▌ | 86/100 [02:58<00:31,  2.25s/it]
 87%|████████▋ | 87/100 [03:00<00:29,  2.26s/it]
 88%|████████▊ | 88/100 [03:02<00:27,  2.27s/it]
 89%|████████▉ | 89/100 [03:03<00:17,  1.62s/it]
 90%|█████████ | 90/100 [03:05<00:18,  1.82s/it]
 91%|█████████ | 91/100 [03:07<00:17,  1.96s/it]
 92%|█████████▏| 92/100 [03:09<00:16,  2.05s/it]
 93%|█████████▎| 93/100 [03:12<00:14,  2.12s/it]
 94%|█████████▍| 94/100 [03:14<00:12,  2.17s/it]
 95%|█████████▌| 95/100 [03:16<00:10,  2.20s/it]
 96%|█████████▌| 96/100 [03:19<00:08,  2.22s/it]
 97%|█████████▋| 97/100 [03:21<00:06,  2.24s/it]
 98%|█████████▊| 98/100 [03:23<00:04,  2.25s/it]
100%|██████████| 100/100 [03:25<00:00,  1.76s/it]
100%|██████████| 100/100 [03:25<00:00,  2.06s/it]
============ Serving Benchmark Result ============
Successful requests:                     100       
Benchmark duration (s):                  205.95    
Total input tokens:                      102300    
Total generated tokens:                  11683     
Request throughput (req/s):              0.49      
Output token throughput (tok/s):         56.73     
Total Token throughput (tok/s):          553.46    
---------------Time to First Token----------------
Mean TTFT (ms):                          102727.44 
Median TTFT (ms):                        101309.32 
P99 TTFT (ms):                           203559.68 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.10     
Median TPOT (ms):                        17.24     
P99 TPOT (ms):                           17.83     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.12     
Median ITL (ms):                         17.08     
P99 ITL (ms):                            17.97     
==================================================
INFO 12-18 19:42:00 [__init__.py:39] Available plugins for group vllm.platform_plugins:
INFO 12-18 19:42:00 [__init__.py:41] - ascend -> vllm_ascend:register
INFO 12-18 19:42:00 [__init__.py:44] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 12-18 19:42:00 [__init__.py:235] Platform plugin ascend is activated
WARNING 12-18 19:42:01 [_custom_ops.py:20] Failed to import from vllm._C with ImportError('/root/miniconda3/envs/pangu/lib/python3.11/site-packages/vllm/_C.abi3.so: undefined symbol: _ZN3c108ListType3getERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEENS_4Type24SingletonOrSharedTypePtrIS9_EE')
INFO 12-18 19:42:05 [importing.py:63] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_mtp:CustomDeepSeekMTP.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_vl:AscendQwen2VLForConditionalGeneration.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_5_vl:AscendQwen2_5_VLForConditionalGeneration.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture DeepseekV2ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV2ForCausalLM.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV3ForCausalLM.
WARNING 12-18 19:42:06 [registry.py:413] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen3_moe:CustomQwen3MoeForCausalLM.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffce4573560>, seed=0, num_prompts=100, dataset_name='random', dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', max_concurrency=None, model='pangu_embedded_7b', tokenizer='/opt/pangu/openPangu-Embedded-7B-V1.1/', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
WARNING 12-18 19:42:08 [tokenizer.py:262] Using a slow tokenizer. This might cause a significant slowdown. Consider using a fast tokenizer instead.
INFO 12-18 19:42:09 [datasets.py:355] Sampling input_len from [1023, 1023] and output_len from [128, 128]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:04<06:45,  4.10s/it]
  2%|▏         | 2/100 [00:04<02:53,  1.77s/it]
  4%|▍         | 4/100 [00:04<01:08,  1.41it/s]
  6%|▌         | 6/100 [00:04<00:38,  2.46it/s]
  8%|▊         | 8/100 [00:04<00:24,  3.71it/s]
 10%|█         | 10/100 [00:07<00:57,  1.56it/s]
 11%|█         | 11/100 [00:07<00:47,  1.86it/s]
 13%|█▎        | 13/100 [00:07<00:31,  2.73it/s]
 15%|█▌        | 15/100 [00:07<00:22,  3.75it/s]
 17%|█▋        | 17/100 [00:07<00:17,  4.66it/s]
 19%|█▉        | 19/100 [00:08<00:22,  3.67it/s]
 20%|██        | 20/100 [00:10<00:43,  1.84it/s]
 21%|██        | 21/100 [00:10<00:36,  2.18it/s]
 23%|██▎       | 23/100 [00:10<00:24,  3.16it/s]
 24%|██▍       | 24/100 [00:10<00:20,  3.69it/s]
 26%|██▌       | 26/100 [00:11<00:15,  4.75it/s]
 27%|██▋       | 27/100 [00:11<00:23,  3.12it/s]
 28%|██▊       | 28/100 [00:13<00:46,  1.54it/s]
 29%|██▉       | 29/100 [00:13<00:37,  1.92it/s]
 31%|███       | 31/100 [00:13<00:23,  2.96it/s]
 33%|███▎      | 33/100 [00:13<00:16,  4.08it/s]
 34%|███▍      | 34/100 [00:14<00:14,  4.48it/s]
 36%|███▌      | 36/100 [00:14<00:18,  3.49it/s]
 37%|███▋      | 37/100 [00:16<00:37,  1.69it/s]
 38%|███▊      | 38/100 [00:16<00:30,  2.05it/s]
 40%|████      | 40/100 [00:16<00:19,  3.01it/s]
 42%|████▏     | 42/100 [00:17<00:14,  3.97it/s]
 45%|████▌     | 45/100 [00:18<00:14,  3.78it/s]
 46%|████▌     | 46/100 [00:19<00:27,  1.94it/s]
 47%|████▋     | 47/100 [00:19<00:23,  2.26it/s]
 48%|████▊     | 48/100 [00:20<00:19,  2.66it/s]
 50%|█████     | 50/100 [00:20<00:13,  3.66it/s]
 52%|█████▏    | 52/100 [00:20<00:09,  4.90it/s]
 53%|█████▎    | 53/100 [00:21<00:14,  3.30it/s]
 54%|█████▍    | 54/100 [00:22<00:28,  1.60it/s]
 55%|█████▌    | 55/100 [00:22<00:22,  1.98it/s]
 56%|█████▌    | 56/100 [00:23<00:18,  2.43it/s]
 58%|█████▊    | 58/100 [00:23<00:11,  3.52it/s]
 60%|██████    | 60/100 [00:23<00:08,  4.84it/s]
 61%|██████    | 61/100 [00:24<00:12,  3.22it/s]
 62%|██████▏   | 62/100 [00:24<00:10,  3.76it/s]
 63%|██████▎   | 63/100 [00:25<00:21,  1.74it/s]
 64%|██████▍   | 64/100 [00:26<00:17,  2.07it/s]
 65%|██████▌   | 65/100 [00:26<00:13,  2.57it/s]
 66%|██████▌   | 66/100 [00:26<00:11,  3.07it/s]
 67%|██████▋   | 67/100 [00:26<00:08,  3.67it/s]
 69%|██████▉   | 69/100 [00:26<00:05,  5.39it/s]
 70%|███████   | 70/100 [00:27<00:09,  3.09it/s]
 71%|███████   | 71/100 [00:28<00:18,  1.59it/s]
 72%|███████▏  | 72/100 [00:29<00:14,  1.93it/s]
 73%|███████▎  | 73/100 [00:29<00:11,  2.42it/s]
 74%|███████▍  | 74/100 [00:29<00:08,  2.92it/s]
 75%|███████▌  | 75/100 [00:29<00:07,  3.52it/s]
 77%|███████▋  | 77/100 [00:29<00:04,  5.23it/s]
 78%|███████▊  | 78/100 [00:29<00:03,  5.75it/s]
 79%|███████▉  | 79/100 [00:30<00:06,  3.25it/s]
 80%|████████  | 80/100 [00:32<00:12,  1.59it/s]
 81%|████████  | 81/100 [00:32<00:09,  1.93it/s]
 82%|████████▏ | 82/100 [00:32<00:07,  2.44it/s]
 83%|████████▎ | 83/100 [00:32<00:05,  2.96it/s]
 84%|████████▍ | 84/100 [00:32<00:04,  3.57it/s]
 86%|████████▌ | 86/100 [00:32<00:02,  4.93it/s]
 87%|████████▋ | 87/100 [00:33<00:03,  4.04it/s]
 88%|████████▊ | 88/100 [00:33<00:03,  3.59it/s]
 89%|████████▉ | 89/100 [00:35<00:06,  1.64it/s]
 90%|█████████ | 90/100 [00:35<00:05,  1.99it/s]
 92%|█████████▏| 92/100 [00:35<00:02,  3.09it/s]
 93%|█████████▎| 93/100 [00:35<00:02,  3.29it/s]
 96%|█████████▌| 96/100 [00:36<00:00,  4.53it/s]
 97%|█████████▋| 97/100 [00:36<00:00,  4.32it/s]
 98%|█████████▊| 98/100 [00:37<00:00,  2.55it/s]
 99%|█████████▉| 99/100 [00:37<00:00,  2.43it/s]
100%|██████████| 100/100 [00:38<00:00,  2.63it/s]
============ Serving Benchmark Result ============
Successful requests:                     100       
Benchmark duration (s):                  38.03     
Total input tokens:                      102300    
Total generated tokens:                  11710     
Request throughput (req/s):              2.63      
Output token throughput (tok/s):         307.90    
Total Token throughput (tok/s):          2997.77   
---------------Time to First Token----------------
Mean TTFT (ms):                          17878.80  
Median TTFT (ms):                        17297.34  
P99 TTFT (ms):                           35506.78  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.30     
Median TPOT (ms):                        23.65     
P99 TPOT (ms):                           45.70     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.61     
Median ITL (ms):                         20.37     
P99 ITL (ms):                            79.48     
==================================================
INFO 12-18 19:43:00 [__init__.py:39] Available plugins for group vllm.platform_plugins:
INFO 12-18 19:43:00 [__init__.py:41] - ascend -> vllm_ascend:register
INFO 12-18 19:43:00 [__init__.py:44] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
INFO 12-18 19:43:00 [__init__.py:235] Platform plugin ascend is activated
WARNING 12-18 19:43:01 [_custom_ops.py:20] Failed to import from vllm._C with ImportError('/root/miniconda3/envs/pangu/lib/python3.11/site-packages/vllm/_C.abi3.so: undefined symbol: _ZN3c108ListType3getERKNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEENS_4Type24SingletonOrSharedTypePtrIS9_EE')
INFO 12-18 19:43:05 [importing.py:63] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture DeepSeekMTPModel is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_mtp:CustomDeepSeekMTP.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture Qwen2VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_vl:AscendQwen2VLForConditionalGeneration.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture Qwen2_5_VLForConditionalGeneration is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen2_5_vl:AscendQwen2_5_VLForConditionalGeneration.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture DeepseekV2ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV2ForCausalLM.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture DeepseekV3ForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.deepseek_v2:CustomDeepseekV3ForCausalLM.
WARNING 12-18 19:43:05 [registry.py:413] Model architecture Qwen3MoeForCausalLM is already registered, and will be overwritten by the new model class vllm_ascend.models.qwen3_moe:CustomQwen3MoeForCausalLM.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcf0f2f560>, seed=0, num_prompts=100, dataset_name='random', dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8002, endpoint='/v1/completions', max_concurrency=None, model='pangu_embedded_7b', tokenizer='/opt/pangu/openPangu-Embedded-7B-V1.1/', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=True, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
WARNING 12-18 19:43:08 [tokenizer.py:262] Using a slow tokenizer. This might cause a significant slowdown. Consider using a fast tokenizer instead.
INFO 12-18 19:43:09 [datasets.py:355] Sampling input_len from [1023, 1023] and output_len from [128, 128]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:03<04:58,  3.02s/it]
  2%|▏         | 2/100 [00:04<03:47,  2.32s/it]
  3%|▎         | 3/100 [00:05<02:09,  1.33s/it]
  5%|▌         | 5/100 [00:05<00:59,  1.60it/s]
  8%|▊         | 8/100 [00:05<00:28,  3.26it/s]
 10%|█         | 10/100 [00:05<00:20,  4.44it/s]
 12%|█▏        | 12/100 [00:05<00:15,  5.77it/s]
 14%|█▍        | 14/100 [00:05<00:12,  7.15it/s]
 16%|█▌        | 16/100 [00:05<00:09,  8.53it/s]
 18%|█▊        | 18/100 [00:05<00:08,  9.80it/s]
 20%|██        | 20/100 [00:08<00:40,  1.99it/s]
 22%|██▏       | 22/100 [00:08<00:29,  2.68it/s]
 25%|██▌       | 25/100 [00:09<00:19,  3.92it/s]
 27%|██▋       | 27/100 [00:09<00:14,  4.91it/s]
 29%|██▉       | 29/100 [00:09<00:11,  6.03it/s]
 32%|███▏      | 32/100 [00:09<00:08,  7.62it/s]
 34%|███▍      | 34/100 [00:09<00:07,  8.73it/s]
 36%|███▌      | 36/100 [00:10<00:07,  8.72it/s]
 38%|███▊      | 38/100 [00:12<00:27,  2.22it/s]
 39%|███▉      | 39/100 [00:12<00:23,  2.55it/s]
 41%|████      | 41/100 [00:12<00:17,  3.42it/s]
 43%|████▎     | 43/100 [00:13<00:12,  4.52it/s]
 45%|████▌     | 45/100 [00:13<00:09,  5.75it/s]
 47%|████▋     | 47/100 [00:13<00:07,  6.85it/s]
 49%|████▉     | 49/100 [00:13<00:06,  8.19it/s]
 51%|█████     | 51/100 [00:13<00:05,  9.45it/s]
 53%|█████▎    | 53/100 [00:14<00:06,  6.89it/s]
 55%|█████▌    | 55/100 [00:14<00:08,  5.60it/s]
 56%|█████▌    | 56/100 [00:16<00:21,  2.07it/s]
 57%|█████▋    | 57/100 [00:16<00:17,  2.46it/s]
 59%|█████▉    | 59/100 [00:16<00:11,  3.47it/s]
 61%|██████    | 61/100 [00:16<00:08,  4.70it/s]
 63%|██████▎   | 63/100 [00:17<00:06,  6.06it/s]
 65%|██████▌   | 65/100 [00:17<00:04,  7.21it/s]
 67%|██████▋   | 67/100 [00:17<00:03,  8.28it/s]
 69%|██████▉   | 69/100 [00:17<00:03,  8.69it/s]
 71%|███████   | 71/100 [00:18<00:05,  5.03it/s]
 72%|███████▏  | 72/100 [00:18<00:05,  5.28it/s]
 73%|███████▎  | 73/100 [00:19<00:08,  3.37it/s]
 74%|███████▍  | 74/100 [00:20<00:12,  2.04it/s]
 75%|███████▌  | 75/100 [00:20<00:09,  2.52it/s]
 77%|███████▋  | 77/100 [00:20<00:06,  3.74it/s]
 81%|████████  | 81/100 [00:20<00:02,  6.57it/s]
 83%|████████▎ | 83/100 [00:21<00:02,  7.12it/s]
 85%|████████▌ | 85/100 [00:21<00:01,  7.88it/s]
 88%|████████▊ | 88/100 [00:21<00:01,  8.17it/s]
 90%|█████████ | 90/100 [00:22<00:01,  6.71it/s]
 91%|█████████ | 91/100 [00:22<00:02,  4.41it/s]
 92%|█████████▏| 92/100 [00:23<00:01,  4.18it/s]
 93%|█████████▎| 93/100 [00:23<00:02,  3.10it/s]
 94%|█████████▍| 94/100 [00:23<00:01,  3.67it/s]
 97%|█████████▋| 97/100 [00:23<00:00,  6.37it/s]
100%|██████████| 100/100 [00:23<00:00,  4.18it/s]
============ Serving Benchmark Result ============
Successful requests:                     100       
Benchmark duration (s):                  23.90     
Total input tokens:                      102300    
Total generated tokens:                  11517     
Request throughput (req/s):              4.18      
Output token throughput (tok/s):         481.79    
Total Token throughput (tok/s):          4761.33   
---------------Time to First Token----------------
Mean TTFT (ms):                          10909.06  
Median TTFT (ms):                        9917.18   
P99 TTFT (ms):                           21092.56  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          30.82     
Median TPOT (ms):                        28.78     
P99 TPOT (ms):                           121.45    
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.44     
Median ITL (ms):                         21.96     
P99 ITL (ms):                            136.45    
==================================================